In [3]:
import pandas as pd

In [7]:
#Q1

In [6]:
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
#Q2

In [9]:
lst=[1,2,3,4,5,6,7,8,9,10]

In [10]:
pd.Series(lst)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [11]:
#Q3

In [18]:
data={
'name':['Alice','Bob','Claire'],
'Age':[25,30,27],
'Gender':['Female','Male','Female']
}

In [19]:
pd.DataFrame(data)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [20]:
#Q4

dataframe is combination of various series or columns
series is a single column of a dataframe.

In [21]:
df=pd.DataFrame(data)

In [23]:
#dataFrame
df

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [25]:
#series
df['name']

0     Alice
1       Bob
2    Claire
Name: name, dtype: object

In [26]:
#Q5

In [27]:
df.head()

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [29]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [30]:
df.shape

(3, 3)

In [31]:
df.columns

Index(['name', 'Age', 'Gender'], dtype='object')

In [32]:
#Q6

Series and DatFrame are mutable

In [33]:
#Q7

In [34]:
data={
'name':['Alice','Bob','Claire'],
'Age':[25,30,27],
'Gender':['Female','Male','Female']
}